app/controllers/pictures_controller.rb

SELECT `pictures`.* FROM `pictures`
---
  def index
    @pictures = Picture.all

INSERT INTO `pictures` (`updated_at`, `created_at`, `image_file_name`, `image_updated_at`, `uri`, `caption`, `image_content_type`, `image_file_size`) VALUES ('2011-05-14 20:58:37', '2011-05-14 20:58:37', 'Photo on 2010-09-23 at 21.42 #2.jpg', '2011-05-14 20:58:37', NULL, NULL, 'image/jpeg', 92027)
---
  def create
    @picture = Picture.create( params[:picture] )