app/controllers/recipes_controller.rb

SELECT `dishes`.* FROM `dishes` WHERE `dishes`.`id` = 1 LIMIT 1
SELECT recipes.*, dishes.* FROM `recipes` INNER JOIN `dishes` ON `dishes`.`id` = `recipes`.`dish_id` WHERE `recipes`.`id` = 1 LIMIT 1
---
  def show
    @recipe = Recipe.find(params[:id].to_i, :joins => :dish, :select => "recipes.*, dishes.*")